console.log("title", "094-construct-else-if-jsPmCdEI")

/* №1⊗jsPmCdEI
  В переменной day лежит какое-то число из интервала от 1 до 31.
  Определите в какую декаду месяца попадает это число (в первую, вторую или третью). */
///////////////////////////////////////////////////////////////////////////////////////////////////

// let day = 22

// if (day > 0 && day <= 10) {
//   console.log("Попадает в первую декаду месяца")
// } else if (day >= 10 && day <= 20) {
//   console.log("Попадает во вторую декаду месяца")
// } else if (day > 20 && day <= 31) {
//   console.log("Попадает в третью декаду месяца")
// }

///////////////////////////////////////////////////////////////////////////////////////////////////

/* №2⊗jsPmCdEI
  Модифицируйте предыдущую задачу так, чтобы, если в переменной day будет не число от 1 до 31,
  выдавалось сообщение об ошибке. */
///////////////////////////////////////////////////////////////////////////////////////////////////

let day = 33

if (day > 0 && day <= 10) {
  console.log("Попадает в первую декаду месяца")
} else if (day >= 10 && day <= 20) {
  console.log("Попадает во вторую декаду месяца")
} else if (day > 20 && day <= 31) {
  console.log("Попадает в третью декаду месяца")
} else {
  console.log("Ошибка! Укажите число в диапазоне от 1 до 31")
}

///////////////////////////////////////////////////////////////////////////////////////////////////
