console.log("title", "078-string-and-number-equality-jsPmCdSNE")

/* №1⊗jsPmCdSNE
  Даны переменные:
  let test1 = '123';
  let test2 = 123;
  Проверьте, равны ли значения переменных и выведите соответствующее сообщение. */
///////////////////////////////////////////////////////////////////////////////////////////////////

let test1 = '123';
let test2 = 123;

if (test1 == test2) {
  console.log("yes")
} else {
  console.log("no")
}

///////////////////////////////////////////////////////////////////////////////////////////////////
