console.log("title", "046-operator-delete-jsPmArOD")

/* №1⊗jsPmArOD
  Дан массив:
  let arr = ['a', 'b', 'c', 'd', 'e'];
  Удалите из него два элемента. Проверьте, какое станет значение свойства length после этого. */
///////////////////////////////////////////////////////////////////////////////////////////////////

// let arr = ['a', 'b', 'c', 'd', 'e'];

// delete arr[1]
// delete arr[2]

// console.log(arr.length)

///////////////////////////////////////////////////////////////////////////////////////////////////
