console.log("title", "033-function-prompt-jsPmBsPmt")

/* №1⊗jsPmBsPmt
  Спросите возраст пользователя с помощью функции prompt.
  Выведите с помощью alert введенный пользователем возраст. */
///////////////////////////////////////////////////////////////////////////////////////////////////

// let age = prompt("Укажите Ваш возраст")
// alert("Возраст пользователя:", age)

///////////////////////////////////////////////////////////////////////////////////////////////////

/* №2⊗jsPmBsPmt
  let num1 = prompt('Введите первое число');
  let num2 = prompt('Введите второе число');
  alert(num1 + num2); // сложит числа как строки
  Переделайте приведенный выше код так, чтобы суммировались числа, а не строки. */
///////////////////////////////////////////////////////////////////////////////////////////////////

// let num1 = Number(prompt('Введите первое число'));
// let num2 = Number(prompt('Введите второе число'));

// alert(num1 + num2);

///////////////////////////////////////////////////////////////////////////////////////////////////

/* №3⊗jsPmBsPmt
  С помощью функции prompt спросите у пользователя сторону квадрата.
  Выведите на экран площадь введенного квадрата. */
///////////////////////////////////////////////////////////////////////////////////////////////////

// let num = Number(prompt("Укажите длинну стороны квадрата"))
// alert(`Площадь квадрата: ${num * num}`)

///////////////////////////////////////////////////////////////////////////////////////////////////

/* №4⊗jsPmBsPmt
  С помощью двух функций prompt спросите у пользователя стороны прямоугольника.
  Выведите на экран периметр введенного прямоугольника. */
///////////////////////////////////////////////////////////////////////////////////////////////////

// let width = Number(prompt("Укажите ширину прямоугольника"))
// let height = Number(prompt("Укажите высоту прямоугольника"))

// alert(`Площадь прямоугольника: ${width * height}`)

///////////////////////////////////////////////////////////////////////////////////////////////////
