console.log("title", "070-programming-approach-via-constants-jsPmObCPW")

/* №1⊗jsPmObCPW
  Перепишите следующий код через описанный подход:
  let arr = [1, 2, 3, 4, 5];
  let res = arr[1] + arr[2];
  console.log(res); */
///////////////////////////////////////////////////////////////////////////////////////////////////

const arr = [1, 2, 3, 4, 5];
const res = arr[1] + arr[2];
console.log(res);

///////////////////////////////////////////////////////////////////////////////////////////////////
