console.log("title", "058-keys-from-variable-jsPmObVK")

/* №1⊗jsPmObVK
  Дан следующий объект:
  let obj = {x: 1, y: 2, z: 3};
  Дана переменная key, в которой хранится один из ключей нашего объекта.
  Выведите с помощью этой переменной соответствующий элемент объекта. */
///////////////////////////////////////////////////////////////////////////////////////////////////

let obj = { x: 1, y: 2, z: 3 };

// let key = "y"
// console.log(obj[key])

let key = obj.y
console.log(key)

///////////////////////////////////////////////////////////////////////////////////////////////////
