console.log("title", "048-introduction-to-objects-jsPmObInr")

/* №1⊗jsPmObInr
  Создайте объект с ключами от 1 до 7, в качестве значений содержащий имена дней недели.
  Выведите на экран все его элементы. */
///////////////////////////////////////////////////////////////////////////////////////////////////

// let obj = {
//   1: "пн",
//   2: "вт",
//   3: "ср",
//   4: "чт",
//   5: "пт",
//   6: "сб",
//   7: "вс",
// }

// alert(obj[1])
// alert(obj[2])
// alert(obj[3])
// alert(obj[4])
// alert(obj[5])
// alert(obj[6])
// alert(obj[7])

///////////////////////////////////////////////////////////////////////////////////////////////////
