console.log("title", "095-nested-if-else-jsPmCdNIF")

/* №1⊗jsPmCdNIF
  Пусть в переменной num хранится число.
  Если это число попадает в диапазон от 10 до 99, то найдите сумму цифр этого числа.
  Если полученная сумма меньше или равна 9, то выведите сообщение о том, что сумма цифр однозначна,
  в противном случае выведите сообщение о том, что сумма цифр двухзначна.*/
///////////////////////////////////////////////////////////////////////////////////////////////////

let num = 19

if (num >= 10 && num <= 99) {
  let toString = String(num)
  let number1 = Number(toString[0])
  let number2 = Number(toString[1])
  let sum = number1 + number2
  console.log("Сумма цифр:", sum)

  if (sum <= 9) {
    console.log("Сумма цифр однозначна")
  } else {
    console.log("Сумма цифр двузначна")
  }

} else {
  console.log("Введенное число не попадает в заданный диапазон")
}

///////////////////////////////////////////////////////////////////////////////////////////////////
