console.log("title", "085-boolean-expression-inversion-jsPmCdLSI")

/* №1⊗jsPmCdLSI
  Дан следующий код:
  if (num1 >= 0 || num2 <= 10) {
    console.log('+++');
  } else {
    console.log('---');
  }
  Используя оператор ! инвертируйте приведенное условие. */
///////////////////////////////////////////////////////////////////////////////////////////////////

let num1 = 1
let num2 = 8

if (!(num1 >= 0 || num2 <= 10)) {
  console.log('+++');
} else {
  console.log('---');
}

///////////////////////////////////////////////////////////////////////////////////////////////////
