console.log("title", "069-constant-jsPmObCn")

/* №1⊗jsPmObCn
  Что выведется в результате выполнения следующего кода:
  const arr = ['a', 'b', 'c'];
  arr[1] = '!';
  console.log(arr); */
///////////////////////////////////////////////////////////////////////////////////////////////////

// const arr = ['a', 'b', 'c'];
// arr[1] = '!';
// console.log(arr);

/* Выведется объект с измененным вторым элементом */

///////////////////////////////////////////////////////////////////////////////////////////////////

/* №2⊗jsPmObCn
  Что выведется в результате выполнения следующего кода:
  const arr = ['a', 'b', 'c'];
  arr = [1, 2, 3];
  console.log(arr); */
///////////////////////////////////////////////////////////////////////////////////////////////////

// const arr = ['a', 'b', 'c'];
// arr = [1, 2, 3];
// console.log(arr);

/* Выведется ошибка, так как была предпринята попытка изменить значение переменной целиком,
а не отдельного свойства объекта или элемента массива. */

///////////////////////////////////////////////////////////////////////////////////////////////////

/* №3⊗jsPmObCn
  Что выведется в результате выполнения следующего кода:
  const arr = ['a', 'b', 'c'];
  arr = ['a', 'b', 'c'];
  console.log(arr); */
///////////////////////////////////////////////////////////////////////////////////////////////////

// const arr = ['a', 'b', 'c'];
// arr = ['a', 'b', 'c'];
// console.log(arr);

/* Выведется ошибка, так как была предпринята попытка изменить значение переменной целиком,
а не отдельного свойства объекта или элемента массива. */

///////////////////////////////////////////////////////////////////////////////////////////////////
