console.log("title", "077-string-equality-jsPmCdSE")

/* №1⊗jsPmCdSE
  Даны переменные test1 и test2, содержащие строки.
  Проверьте, равны ли их значения и выведите соответствующее сообщение. */
///////////////////////////////////////////////////////////////////////////////////////////////////

let test1 = "abc"
let test2 = "def"

if (test1 == test2) {
  console.log("yes")
} else {
  console.log("no")
}

///////////////////////////////////////////////////////////////////////////////////////////////////
