console.log("title", "051-object-properties-jsPmObPr")

/* №1⊗jsPmObPr
  Создайте объект date с ключами 'year', 'month' и 'day' и значениями, соответствующими текущему дню.
  Выведите созданную дату на экран в формате год-месяц-день. */
///////////////////////////////////////////////////////////////////////////////////////////////////

// let date = {
//   year: "2023",
//   month: "02",
//   day: "28",
// }

// alert(`${date.year}-${date.month}-${date.day}`)

///////////////////////////////////////////////////////////////////////////////////////////////////
