console.log("title", "049-output-total-object-jsPmObEOD")

/* №1⊗jsPmObEOD
  Создайте объект с ключами от 1 до 12, в качестве значений содержащий названия месяцев.
  Выведите этот объект в консоль. */
///////////////////////////////////////////////////////////////////////////////////////////////////

let obj = {
  01: "январь",
  02: "февраль",
  03: "март",
  04: "апрель",
  05: "май",
  06: "июнь",
  07: "июль",
  08: "август",
  09: "сентябрь",
  10: "октябрь",
  11: "ноябрь",
  12: "декабрь",
}

console.log(obj)

///////////////////////////////////////////////////////////////////////////////////////////////////
